---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameter.CanAssignFormula
source: html/93a609f7-78f1-d152-ab3e-1fddc1061a9a.htm
---
# Autodesk.Revit.DB.FamilyParameter.CanAssignFormula Property

Indicates if this parameter can be assigned a formula.

## Syntax (C#)
```csharp
public bool CanAssignFormula { get; }
```